{"/boost":{"title":"Boost","data":{"":"Your browser does not support the video tag.\nBoost mode is very effective for producing a large number of new edited videos from a fixed video.It is a unique system for those interested in affiliate marketing, dropshipping, etc. and those who want to produce conceptual content for social media.","how-many#How Many":"When Boost mode is activated, the \"How Many\" option appears on the screen.This option determines the number of videos you want to produce.You can transform the content of your products into any number of new content types using our content creation methods such as General Settings,\r\nOptions and Custom, which we explain under the \"Common\" structure."}},"/common/custom":{"title":"Custom Design","data":{"":"If you want to decorate your videos with special designs, you can take advantage of this feature.\nYour browser does not support the video tag.","custom-video-settings#Custom Video Settings":"By default, your vertical videos take up the entire frame.However, with the custom design option, you can overcome this rule and place your videos on the screen in any size you want.","main-video-settings#Main Video Settings":"To show your main video in the frame in the desired dimensions and position, respectively;Width, Height, X Coordinate and Y Coordinate values can be entered here.Ex : 500,750,0,225","merged-video-settings#Merged Video Settings":"When the Options > Merge Video feature is used, this option can be used to customise the resolution and positions of the merged video.The operation logic is the same as the Main Video Settings.","custom-background#Custom Background":"You can use this field to change the color or design of your frame.","type-of-background#Type of Background":"There are two background type options, Color and Image/Gif.","color#Color":"When the color option is activated\nBlack\nWhite\nRed\nBlue\nGreen\nYellow\nPurple\noptions and\nCustom Color\noption arises.If you wish, you can use ready-made colors or you can use the Custom Color option.\r\nYou can choose a different color for the background by using the HEX code of a color.","imagegif#Image/Gif":"If you want to define an image or gif to your background instead of a fixed color, you can use this field.After adding the vertical image/gif you want to define to the background to a folder, you can integrate it into the system via this option."}},"/common":{"title":"Common Features","data":{"":"The VE3.Plus system has some common features for all modes.You can freely edit your videos using these common features."}},"/common/general-settings":{"title":"General Settings","data":{"":"Zoom, mirror, rotate, etc. regarding the system. This is the area where you can apply the settings."}},"/common/general-settings/crop":{"title":"Kırp","data":{"":"Your browser does not support the video tag.\nYou can adjust the places you want to crop in the main video and the merged video from here. The cropped areas in the created content will be displayed."}},"/common/general-settings/mirror":{"title":"Mirror","data":{"":"Your browser does not support the video tag.\nIf you want to apply a mirror effect to your videos, you can use this option.Mirror effects can be applied to both the main video and the merged video."}},"/common/general-settings/speedup":{"title":"Speed Up","data":{"":"Your browser does not support the video tag.\nIf you want to increase the speed of the video, the Speed Up option can be applied to both the main video and the merged video.The speed is 1 by default. 1.2, 1.5, 2 etc. speed values can be entered."}},"/common/general-settings/zoom":{"title":"Zoom","data":{"":"Your browser does not support the video tag.\nAllows you to set zoom settings for the Main video and the Merged video. Only the centre of the screen is zoomed.The lowest setting is 1 and the highest setting is 10."}},"/common/general-settings/rotate":{"title":"Rotate","data":{"":"Your browser does not support the video tag.\nIf you want to rotate your videos, you can use this option.If you put ‘ minus ( - ) ’ before the numbers you enter, the video will be rotated in the opposite direction."}},"/common/general-settings/rounded-corners":{"title":"Rounded Corners","data":{"":"Your browser does not support the video tag.\nIf you want the corners of your videos to be curved, this feature will meet your needs."}},"/common/options":{"title":"Options","data":{"":"There are numerous options available to personalize your work and create different designs."}},"/common/options/add-image-t":{"title":"Add Images(T)","data":{"":"If you want to add transparent images, you can use this area.\nYour browser does not support the video tag.\nThe working logic is the same as the Add Image option. It was created to use transparent images and normal images separately.","imagest#Images(T)":"Add the transparent images you want to use in a folder in order and define the folder to the system from the Images (T) section.","number-of-imagest#Number of Images(T)":"You can add up to 5 transparent images to your content. You can customise the size and position of these images and apply transparency settings.You can set how many images you want to use in the Number of Images (T) section.","image-settingst#Image Settings(T)":"Width, Height, X and Y coordinate settings of the added images are made here.According to the number of images you add, you can create the settings of each image with the expression ‘ :: ’.","example#Example":"Suppose we want to add 4 images to our work.We put 4 images in a folder and defined them to the system.Then we set the Number of Images as 4.We need to enter the resolutions of our images and the position information if we want them to be placed in which positions.Let's create sample resolutions and positions.\nProcess order: Width, Height, X, Y should be created.\n250,420,50,290::400,120,140,80::110,270,35,65::350,200,45,90As a result of these settings, 4 images will be integrated into the content in the resolutions and positions we desire.","opacity-settingst#Opacity Settings(T)":"You can use this option to adjust the transparency of your images.A value between 1 and 9 can be given.As you get closer to 9, the image becomes more prominent. Transparency increases as you move away from this value.In cases where more than one image is used, a separate value can be entered for each image using the :: parameter.","example-1#Example":"You have used three images and you want to set transparency for all three.In this case, if 5 value is written in the Opacity Settings section, this value is applied for all images.However, if you want to define separate values for each image, you can define separate values for each image as 5::2::7.","time-rangewide#Time Range(Wide)":"It is the feature that becomes available when the Time Range(Wide) option is activated.Hit Gun > Wide mod allows you to create horizontal content. In this content, you can create content that stays on the screen for a certain period of time and then disappears.\r\nThis feature can be used to create the images you want.For example, when 5-15 is written in the Time Range section, the relevant image appears at the 5th second of the video and disappears after remaining on the screen until the 15th second."}},"/common/general-settings/text":{"title":"Text","data":{"":"Your browser does not support the video tag.\nYou can use the Text feature to add text to your videos.\nUsing this feature to add text can be challenging.\nAdding the text you want to add to the videos using images can make your process easier.","add-text#Add Text":"You can use here to add text to your videos.You can add many texts and determine their positions, colors, fonts and sizes individually.","rules#Rules":"While making your settings, you can separate each text with the \"::\" parameter.For example, when you want to add two separate textsYou can parse these texts as your first text::your second text.When you want to enter details about these texts, such as font size and text color, you can use the same\r\nYou can complete your settings for each post by using the \"::\" parameter.","text-size#Text Size":"This is the area where you determine the size of the texts you add.","text-color#Text Color":"This is the section where you can adjust the color settings of your texts.","text-coordinates#Text Coordinates":"Text positions are determined here. You can determine the location of your texts by entering X and Y coordinates.","text-font#Text Font":"If you want to add special fonts to your texts, you can use here. You can choose any of the Windows fonts on your computer.","text-opacity#Text Opacity":"The transparency of the texts is adjusted here. As value decreases, transparency increases."}},"/common/options/add-image":{"title":"Add Image","data":{"":"This is the option where you can add images to your videos.\nYour browser does not support the video tag.","images#Images":"Add the images you want to use in a folder in order and define the folder to the system from the Images section.","number-of-images#Number of Images":"You can add up to 5 images to your content. You can customise the size and position of these images and apply transparency settings.You can set how many images you want to use from the Number of Images section.","image-settings#Image Settings":"Width, Height, X and Y coordinate settings of the added images are made here.According to the number of images you add, you can create the settings of each image with the expression ‘ :: ’.","example#Example":"Suppose we want to add 4 images to our work.We put 4 images in a folder and defined them to the system.Then we set the Number of Images as 4.We need to enter the resolutions of our images and the position information if we want them to be placed in which positions.Let's create sample resolutions and positions.\nProcess order: Width, Height, X, Y should be created.\n250,420,50,290::400,120,140,80::110,270,35,65::350,200,45,90As a result of these settings, 4 images will be integrated into the content in the resolutions and positions we desire.","opacity-settings#Opacity Settings":"You can use this option to adjust the transparency of your images.Values between 1 and 9 can be given.As it approaches 9, the image becomes more prominent. Transparency increases as you move away from this value.In cases where more than one image is used, a separate value can be entered for each image with the ‘ :: ‘ parameter to enter a separate value for each image.","example-1#Example":"You have used three images and you want to set transparency for all three.In this case, if 5 value is written in the Opacity Settings section, this value is applied for all images.However, if you want to define separate values for each image, you can define separate values for each image as 5::2::7."}},"/common/options/add-intro-outro":{"title":"Add Intro/Outro","data":{"":"Your browser does not support the video tag.\nThis feature can be used to add intro and outro to vertical videos.Only the use of images and gifs is enabled.","add-intro#Add Intro":"To add Intro to your vertical videos, simply activate this feature.When activated, two new features called Intro Duration and Intro File appear.","intro-duration#Intro Duration":"You can specify how many seconds you want the image or gif you added to be displayed on the screen at the time of entry.The maximum value is 10 seconds.","intro-file#Intro File":"After adding your intro file (image or gif) to a folder, you can define your folder to the system via the Intro File option.","add-outro#Add Outro":"To add Outro to your vertical videos, simply activate this feature.","outro-duration#Outro Duration":"You can specify how many seconds you want the image or gif you added to be displayed on the screen at the end of the video.The maximum value is 10 seconds.","outro-file#Outro File":"After adding your outro file (image or gif) to a folder, you can define your folder to the system via the Outro File option."}},"/common/options/add-logo":{"title":"Add Logo","data":{"":"Your browser does not support the video tag.\nIf we want our logo to be included in our works, we can apply this process through the Add Logo option.When it is checked, there will be 3 options: a field for adding logo, logo settings and logo opacity.","logo-settings#Logo Settings":"You can determine the size and position of the logo you added from this field.You must enter Width, Height, X Coordinate, Y Coordinate values respectively (Ex: 100,150,50,200).","logo-opacity-setting#Logo Opacity Setting":"You can use this field to make your logo transparent.A value of 9 provides the clearest image. As 1 value is approached, the image becomes transparent."}},"/common/output":{"title":"Output","data":{"":"This is where we define the folder where we want the generated content to be saved.\nYour browser does not support the video tag.","remove-metadata#Remove Metadata":"If the system detects metadata in the files, enabling this option will remove these metadata from the generated videos.","play-result#Play Result":"If we want the generated content to be played after being saved, we can check this box. This way, you can quickly view the results you've produced."}},"/common/options/merge-video":{"title":"Merge Video","data":{"":"When the Merge Video option is enabled, new videos can be integrated into the content to be produced.It has a similar structure to the Sync feature in the Hit Gun system.\nYour browser does not support the video tag.","video-to-merge#Video to Merge":"You can define the videos you want to combine with the content to be produced here.Scenes will be used according to the settings you specify in the Duration Setting.","duration-setting#Duration Setting":"There are three different duration settings, Default, Random and Custom Duration.","default#Default":"The default duration setting starts at the 10th second of the merged video. The main reason for this is the possibility of an intro in the combined video.In order to directly merge the content, the merging process starts from the 10th second.","random#Random":"Starts the merging process from a random duration of the merged video.For example, if you choose to use a 40-minute video as the merged video, the merging will start from different durations of the merged video for each video being worked on.","custom-duration#Custom Duration":"This is the field where you can enter the start time of the merged video.For example, if you enter 20, the merging process starts from the 20th second of the merged video.\nThe custom duration is entered in seconds.","main-video-position#Main Video Position":"As with the Hit Gun/Sync structure, the main video position can be changed in the Merge Video structure.Unlike the Sync structure, there are also left and right options here.In other words, the main video can be on the top, bottom, left or right.","main-video-ration#Main Video Ration":"Determines the proportion of the main video in the frame.The default is 70%.","merged-video-opacity#Merged Video Opacity":"The opacity of the merged video is set here. If you want your video to become transparent, you can enable this setting and adjust the opacity.The higher the number entered, the higher the clarity, the lower the transparency.","use-merged-video-sound#Use Merged Video Sound":"Created videos have the main video audio by default.If you want to use the audio of the merged video, you can enable this setting."}},"/common/options/add-sound":{"title":"Add Sound","data":{"":"If we want to use external audio in our videos, we can use the Add Audio feature to accomplish this.\nOnly audio files with the .mp3 extension can be integrated.\nWe can add our audio file by adding it to a folder and defining the folder in the system, then we can add the desired sound to the videos."}},"/common/resource":{"title":"Resource","data":{"":"This is the section where the content to be edited is identified.It contains three options: Videos, URL, and URL List.","videos#Videos":"If we want to perform editing with videos from our computer, we use this option.Videos are added to a folder, and the folder is defined in the system with this option.","url#URL":"URL is a feature associated with the Hit Gun mode, along with URL List.\nIt can only be used for YouTube videos.\nThe link to the YouTube video we want to work with is defined in the system from this section.","url-list#URL List":"If we want to process multiple YouTube videos simultaneously, we use URL List.After adding the links one below the other in a notepad, the notepad is defined in the system.\nIn Hit Gun mode, there is a sequence of operations for using resources.\nIf URL List is active, the system disregards other options and attempts to operate through URL List.\nIf URL List is passive, the operation proceeds based on the URL. If no link is defined in the URL, the Videos option is used.","proxy#Proxy":"If you want to use the URL feature with Proxy, you can enable the Proxy option.","proxy-list#Proxy List":"To use the proxy feature, a notepad containing your proxies must be defined to the system from the Proxy List option.","proxy-static-username#Proxy Static Username":"If you have a proxy that connects with username and password and all your proxies have the same user and password defined, you can enter your username in this field.","proxy-static-password#Proxy Static Password":"If all your proxies have the same password, you can enter it in this field.","proxy-rules#Proxy Rules":"Proxy type must be Http. Https or Socks5 proxies are not supported.\nIf you have many proxies with different users and passwords, you should enter them in the notepad as\nIP:Port:Username:Password.If you have the same user and password, you can only enterIP:Port in the notepad.You can enter your username and password in Proxy Static Username and Proxy Static Password fields.If you do not have any username and password, just defineIP:Port.\nProxies should be listed one below the other in the notepad.\nE.g :\nAvailable proxies are used in a randomized way. For each run a random proxy is selected from the list.\nIt is recommended to add at least 10 http proxy types for proxy usage.","where-can-i-buy-http-proxy#Where Can I Buy Http Proxy?":"You can purchase it from Webshare.io."}},"/hitgun":{"title":"Mod: Hit Gun","data":{"":"Your browser does not support the video tag.\nHit Gun is the most advanced build of the VE3.Plus system.It enables the production of all types of content, from horizontal videos to verticals.It has five core features called Factory, Viral, Wide, Render and Subtitles.All of these features have unique sub-features within them."}},"/common/test":{"title":"Fast Test","data":{"":"Your browser does not support the video tag.\nBefore starting an actual rendering process, you can use the Fast Test feature to create an overview of the result.In this way, you can run your tests and save time until the desired output is created.","fast-test-setting#Fast Test Setting":"There are two fast test settings.","show-the-first-seconds-of-the-result#Show the first seconds of the result":"This test setting produces video only for the first seconds of the result.There are two separate options as the first 15 seconds and the first 30 seconds.","show-as-image#Show as image":"When checked, it takes an image from a random moment of the result and shows it.Especially if you have used images, logos, etc., it may be preferred to use them to make sure that they are positioned as you wish."}},"/hitgun/factory":{"title":"Factory","data":{"":"Your browser does not support the video tag.\nIt contains the most important sub-features of Hit Gun mode.From the duration to the number of videos to be produced, from the production method to the design, many details are prepared here."}},"/hitgun/factory/area":{"title":"Area","data":{"":"The Hit Gun system always creates \"vertical\" videos when the Wide option is not active.The area section is where these vertical videos can be customized.It has three separate options: Default, Custom, and Advanced."}},"/hitgun/factory/area/custom":{"title":"Custom","data":{"custom#Custom":"It allows changing the default value of %38.By increasing or decreasing this value, the user can save the desired area of the target video."}},"/hitgun/factory/how-many":{"title":"How Many","data":{"":"In the Method feature of the Factory settings, there are three options available:\nRandom\nMinute\nInterval\nWhen the Random or Interval/Random options are checked, you determine the number of videos you want to generate through this feature.The number you enter determines the number of videos produced."}},"/hitgun/factory/area/advanced":{"title":"Advanced","data":{"advanced#Advanced":"The Advanced area is a more complex structure.In all other options, images from the target video start at the top and descend to the bottom. Proportions are created based only on the left and right areas.For example, at 38%, the 31% areas to the left and right of the video are ignored and do not appear in the recorded mp4 file.The advanced option allows us to intervene in the entire target video.We can save any point, frame we wish.If the Advanced option is selected, two ``Custom Area Type‘’ named Percent and Pixel are created.","custom-area-type-percent#Custom Area Type: Percent":"This is where we select the part we want to capture from the target video with percentage expressions.\nThe biggest benefit is that it eliminates the need to calculate resolution.As it is known, the resolution of each video can be different from each other.\r\nTherefore, especially when working with a large number of different target videos, working on ‘fixed values’ may cause problems.In order to minimise these problems, using percentage expressions will provide more accurate results.When the percentage option is selected, the Custom Area Percent option appears.The order here is : Top, Bottom, Left, Right.We write our percentages from the top, bottom, left and right according to the area we want to select and the remaining part is the part we will save.Example : 5,55,60,6","custom-area-type-pixel#Custom Area Type: Pixel":"Allows to select the area to be selected from the target video with pixels.When ticked, the Advanced Area - Pixel option appears on the screen.Here, Width, Height, X and Y coordinates must be entered sort of.The entered width and height values indicate the width and height of the area to be selected in the target video. X and Y are the coordinates where this area is located.","example#Example":"We can use Paint to explain the Pixel property through the image above:To find the resolution values (video resolution) of the red frame, we can access the resolution of this area when we select the relevant area using the ‘Select’ feature of Paint.The resolution of our video that we want to select a special area is 737x385.\nThe resolution of the blue area we want to select in the video is 223x192.\nThat is, in order to be able to select the relevant area in an image with a resolution of 737x385, our resolution setting must be 223x192.After determining our resolution setting, we need to determine the X and Y coordinates of this resolution.In this case, in order to determine the location, we need to move the mouse to the starting point of the area we want to select.\nWhen the mouse is moved to the location indicated by the red dot, we can see from the bottom left that the X and Y values of the relevant location are 499,52.The first value is X and the second value is Y coordinate.In this case;X coordinate : 499Y coordinate : 52becomes.In the last case, since we have both resolution and X and Y coordinates, we can enter these values into the system.The values we need to define in our system will be as follows respectively:223,192,499,52In case the resolution of the target content is 737x385, if the above data is defined in the system, the relevant area will be selected and only the image of this area will appear in the produced video."}},"/hitgun/factory/method":{"title":"Method","data":{"":"Your browser does not support the video tag.\nThe video generation method is determined in this area.There are three separate options: Random, Minute, and Interval.The selected option allows for duration settings to be made based on the target videos.It is one of the fundamental structures of the Hit Gun system. Works are built on this structure."}},"/hitgun/factory/area/default":{"title":"Default","data":{"default#Default":"Vertical video productions are created by selecting a vertical area from the middle of the target video.When the default mode is active, the value of the selected area is %38.The portions within the %38 area are saved as a new mp4 file."}},"/hitgun/factory/method/interval":{"title":"Interval","data":{"":"The interval method allows for work to be done on entered time intervals.It has two sub-modes: Random and Regular.","random#Random":"When the Random mode is active, content production is carried out within the entered time intervals for the number of productions written in the \"How Many\" section.###Example\r\nSettings for a 40-minute YouTube video are as follows:\nURL\tyoutube.com/video-id\tHow Many\t3\tIntervals\t2:14-3:21,6:16-9:19,17:21-24:18,34:13-39:21\tVideo Duration/Fixed\t15\tMethod\tInterval/Random","result#Result":"Intervals\tNumber of Produced Videos\t2:14-3:21\t3\t6:16-9:19\t3\t17:21-24:18\t3\t34:13-39:21\t3\t\nFor each time interval, a total of 3 videos of 15 seconds each are randomly produced.At the end of this process, we have a total of 12 videos.","regular#Regular":"When the Regular option is active, content production occurs for all entered time intervals.","example#Example":"Let's continue with a few minor changes to the example provided above.Here are the settings for a 40-minute YouTube video:\nURL\tyoutube.com/video-id\tIntervals\t2:14-3:21,6:16-9:19,17:21-20:18,34:13-36:21\tVideo Duration/Fixed\t45\tMethod\tInterval/Regular","result-1#Result":"Intervals\tProduction Periods\tNumber of Produced Videos\t2:14-3:21\t2:14-2:59,2:59-3:44\t2\t6:16-9:19\t6:16-7:01,7:01-7:46,7:46-8:31,8:31-9:16,9:16-10:01\t5\t17:21-20:18\t17:21-18:06,18:06-18:51,18:51-19:34,19:34-20:19\t4\t34:13-36:21\t34:13-34:58,34:58-35:43,35:43-36:28\t3\t\nAs seen, different numbers of contents were created for different time intervals.Each created content is 45 seconds long.When the duration of the last content exceeds the entered time interval, content production is terminated."}},"/hitgun/factory/method/minute":{"title":"Minute","data":{"":"The minute method allows you to create content from desired durations of the target video.It has two sub-modes: Default and Range.","default#Default":"The default mode allows you to specify the start times of the scenes you want to create segments for.The desired durations for the operation are added to a notepad separated by commas (e.g., 1:13, 2:46, 7:19, 26:12).\r\nThe notepad is defined in the system from the Minutes section.","example#Example":"Let's assume we want to extract 4 scenes from a 30-minute YouTube video.\nURL\tyoutube.com/video-id\tMinutes\t1:13,2:46,7:19,26:12\tVideo Duration/Fixed\t40\tMethod\tMinute/Default","result#Result":"Video\tStart\tEnd\t1\t1:13\t1:53\t2\t2:46\t3:26\t3\t7:19\t7:59\t4\t26:12\t26:52\t\nOnce the process is complete, the 4 new videos created from the time intervals shown in the table will be saved to the folder you specified on your computer.","range#Range":"If you want to select any time interval instead of entering a Video Duration, you can use the Range mode.With this feature, you can specify custom time intervals and save all the scenes you want.Time intervals should be expressed with a \" - \" sign, and different scenes should be separated by commas (\",\").","example-1#Example":"Let's say we want to create separate content for 6 different scenes from a 3-hour video on our computer.\nVideos\tC://path/file-name.mp4\tMinutes\t14:21-16:35,26:19-32:13,45:54-56:12,58:17-1:16:12,1:45:18-2:14:42,2:27:13-2:43:19\tMethod\tMinute/Range\t\nAs a result of this process, 6 contents consisting of the specified time intervals will be created in the designated output folder."}},"/hitgun/factory/method/random":{"title":"Random","data":{"":"The random method allows for the selection of a random duration from the target video.For example, let's assume we want to create 9 pieces of content from a 2-hour YouTube video.","example#Example":"URL\tyoutube.com/video-id\tHow Many\t9\tVideo Duration/Fixed\t30\tMethod\tRandom\t\nAfter the above settings, 9 random start times are determined within the 2-hour video, and 30-second content pieces are created.","result#Result":"Video\tStart\tEnd\t1\t14:36\t15:06\t2\t25:13\t25:43\t3\t29:42\t30:12\t4\t43:17\t43:47\t5\t1:11:24\t1:11:54\t6\t1:32:19\t1:32:49\t7\t1:43:05\t1:43:35\t8\t1:51:44\t1:51:14\t9\t1:55:32\t1:56:02\t\n9 videos are created separately in the time intervals listed in the table and saved to the designated folder in mp4 format."}},"/hitgun/factory/sync":{"title":"Sync","data":{"":"Allows the target video to be integrated into the vertical video produced.If checked;Main Video Position - Main Video Ratio - Merged Areaoptions arise.\nYour browser does not support the video tag.","main-video-position#Main Video Position":"Main video refers to the vertical video produced.The main video position has two options, Top and Bottom.By default, the Top option is selected and the main video is at the top of the produced content.When the Main Video Position is marked as Bottom, the Sync video moves to the top and the main video is at the bottom.","main-video-ratio#Main Video Ratio":"The main video ratio refers to the space that the main video occupies on the split screen.By default, this ratio is 70. 70 means 70%.The remaining 30% is occupied by the merging video.","merged-area#Merged Area":"Specifies the area to be covered by the synchronised video.There are two options, Default (100%) and Advanced.","default100#Default(100%)":"The entire target video is integrated.","advanced#Advanced":"If you want to integrate a part of the target video instead of the whole video, you can use the advanced option.If the Advanced option is selected, two Merged Custom Area Type named Percent and Pixel will appear.","merged-custom-area-percent#Merged Custom Area: Percent":"The working principle is the same as the structure we explained under the title Area > Advanced > Custom Area Type: Percent.It allows us to select the desired area from the synchronised video with percentage ratios.For details click here.","merged-custom-area-pixel#Merged Custom Area: Pixel":"The working principle is the same as the structure we explained under the title Area > Advanced > Custom Area Type: Percent.It allows the area to be selected from the target video to be selected with pixels.For details click here."}},"/hitgun/render":{"title":"Render","data":{"":"Your browser does not support the video tag.\nThis is the area where you can determine the production quality and production speed of your content.\nCurrently active only for Hit Gun mode.\nThere are two different rendering options: CPU and GPU.When GPU is checked, the rendering process proceeds through the video card.It supports Nvidia and Amd video cards.","quality#Quality":"When the GPU option is selected, there are two quality options, High and Good.You can select High to get better quality videos\r\nbut the rendering process may take a little longer compared to Good.","speedurl#Speed(URL)":"When working with Youtube videos, the working speed can be set here.There are two speed modes. Turbo and Normal.","turbo#Turbo":"When the Turbo option is activated, the Turbo Mode option appears on the screen.Turbo Mode has 5 speed options as;Normal - Fast - Faster - Faster - Rapid - Blistering.You can set your speed according to your system power.\nIn cases where your system power is insufficient, video loss may occur. It is therefore advisable to monitor the content produced when using the \"Rapid\" and \"Blistering\" options.\r\nIf you experience losses, you can choose lower speeds."}},"/hitgun/factory/video-duration":{"title":"Video Duration","data":{"":"This is the section where the duration settings of the generated videos are adjusted.There are two different options: Fixed and Flex.\nYour browser does not support the video tag.","fixed#Fixed":"When checked, contents are generated with the entered value length.For example, when 30 is entered, each generated content will be 30 seconds long.","flex#Flex":"It selects a random value from the range of values entered in Min Duration and Max Duration and generates content with this value length.For example, let's say Min Duration is set to \"```30\", **Max Duration** is set to \"200``\" and the system chooses the value 142 among these values.**The length of the video will be 142 seconds."}},"/hitgun/viral":{"title":"Viral","data":{"":"It is one of the most effective features of the Hit Gun system.It allows you to produce interesting content with the audio file you want.You can also produce similar videos by defining video.\nOther features are currently disabled while Viral is active."}},"/hitgun/subtitles":{"title":"Subtitles","data":{"":"Your browser does not support the video tag.\nIt is a sub-feature of the Hit Gun mode.\nCurrently it can only be used with the Factory feature.","language#Language":"The language option includes Sub Mod. Here, the mode of our subtitle is determined.","video-lang#Video Lang":"When the Video Language option is activated, subtitles are created only in the original language of the video used.","another-lang#Another Lang":"This feature is used to translate the original language into subtitles in a different language.The actual language of the video is determined in the Source Video - Lang section.In the Target - Lang section, the subtitle language to be produced is selected.","design#Design":"If we want to customize our subtitles, we can use the Design option.","font#Font":"We can use it to show our subtitles with different fonts.","font-size#Font Size":"This is the area where we can set the size of the subtitles. In addition to a few fixed values, there is also a section where you can specify a custom size.","font-color#Font Color":"You can change the subtitle colour here.","shadow#Shadow":"If you want to create your subtitles on a black area instead of creating them directly, you can activate the Shadow option.When the Black option is selected, subtitles are created directly on a black print.When the Transparent option is selected, the subtitles are rendered on a transparent black area.","choose-position#Choose Position":"This is the area where you can set the location of your subtitles.In addition to the positions suggested by the system, you can specify a custom position, enter the coordinates and display your subtitles wherever you want."}},"/hitgun/viral/durations":{"title":"Durations","data":{"":"The Viral feature has two modes. Regular and Random.","regular#Regular":"In regular mode, the times should only show the relevant durations.\nThe duration should not be less than the total number of scenes in the audio file.\nIf only seconds are to be entered, no data other than seconds should be added.","random#Random":"Time intervals are entered when random mode is active.\nThe time intervals entered are in minutes and hours only."}},"/hitgun/viral/custom-sound":{"title":"Add Custom Sound","data":{"":"There are three separate options in the Add Custom Sound section.\nNo\nWeb\nVideo\nNo option means the function is kept passive.","web#Web":"Thanks to the web feature, you can play the audio from any duration of any video on Youtube,\r\nYou can quickly produce content by integrating it into the system in seconds.\nSimply define the sounds you want to add in a notepad as in the example above.Things to pay attention","listtxt-order#list.txt Order":"Firstly, determine the order of your content in list.txt. For example, if you have created 10 audio files, start the order of your web file from 11.For details about list.txt Click here.","determining-durations#Determining Durations":"Once you have created the order of your content, determine the duration of your scenes by adding a \" | \" sign.For example, you will use 15 seconds of audio and you want to create 6 different scenes in it.In this case, you can determine your scene durations as 4.1,2.6,1.3,2.8,1.7,2.5.","determining-url-duration#Determining URL Duration":"In the next step, you need to determine at what time of the video the sound you want to use is located by adding a \"|\" sign after the scene durations.Let's say you want to work on a sound that appears at the 25th minute and 34th second of a 40-minute video and continues for 15 seconds.In this case, you need to carry out a process as in the image.","add-url#Add URL":"At the last stage, all you need to do is add the YouTube URL you want to work on.","define-sound#Define Sound":"The number of queues you initially created for your sound file should be defined in the Sounds field.\r\nIn this way, it is possible to use the sounds both on your computer and on the Web at the same time.\nThe created sounds are automatically saved to your sounds file.You can use these sounds again and again in your subsequent works.It will be helpful to review the order of your audio files before each new run to avoid confusion and problems.","video#Video":"When the Video option is activated, content production is realised through the videos defined in the Video Folder.\nThe system processes the video you upload and creates new content on the subject you desire with the same audio and video transitions.You do not need to enter any values in the Sounds section, only the videos you add will be processed.For example,You are interested in a video with many video scenes created with a voice on Instagram Reels.You wanted to use a content structure with the same sound and transitions in the sector/category you desire.You only need to download the video to your computer and define it to the system, configure your duration settings and determine which source you want to produce content from.","video-settings#Video Settings":"When you want to produce viral content with the video identification system, you can determine the sensitivity of the content analysis from this area.The default value is 20.If you think content is being created that does not match the transition times of the video you have defined\r\nEntering values below 20 here will provide better results."}},"/hitgun/viral/fullscreen":{"title":"Fullscreen","data":{"":"When fullscreen is not selected, content is produced from the middle area of the videos.\r\n \r\n \r\n \r\n \r\n \nWhen the full screen option is selected, the selected videos are made horizontal and the entire video is used."}},"/hitgun/viral/sounds":{"title":"Sounds","data":{"":"Sounds is the area where the sounds desired to be used in viral content are defined.If the Add Custom Sound option is not selected as ‘Video’, all sounds to be used are determined here.In the example, it was decided to use the 1st, 3rd and 4th sounds.\nThe order of the sounds to be used is determined by the list.txt file in the viral folder in the VE3.Plus system.\nAudio details are organised in the list.txt file.Each sound starts with a number to create an orderly sequence.The settings are separated from each other by a ‘ | ’ sign.\nIf you want to make special definitions and names for the sounds, the sound file can be named by adding the ‘ - ’ sign after the number.Then, by adding the ‘ | ’ sign, the sound settings are entered.Each sound setting entered determines the duration of that scene."}},"/hitgun/viral/viralmods":{"title":"Viral Mods","data":{"":"Your browser does not support the video tag.\nRegular ve Random olmak üzere iki adet viral modu bulunmaktadır.","regular-mod#Regular Mod":"If you want to produce content with fixed durations, this mode will meet your needs.For exampleLet 4 scenes of the sound file you are using be specified with durations 4.1, 2.3, 3.6, 1.9.For these 4 scenes, you wanted to produce content by using video footage\r\nfrom the minutes 14:13, 21:36, 33:17 and 38:11 of a 40-minute video.In this caseThe first scene starts at 14:13 minutes and continues until (+4.1)14:17.1.The second scene starts at 21:36 minutes and continues until (+2.3)21:38.3.The third scene starts at 33:17 minutes and continues until (+3.6)33:20.6.The last scene starts at 38:11 minutes and continues until (+1.9)38:12.9.A new content is created from the video images obtained with the relevant audio file.\nIn Regular mode, production takes place according to the times entered.\nIn Regular mode, only the time is entered. Like 14:11, 21:16, 1:27:19.","random-mod#Random Mod":"When Random mode is activated, random scenes are selected from the time intervals you enter and a new video is created with this content.For exampleLet 4 scenes of the sound file you are using be specified with durations 4.1, 2.3, 3.6, 1.9.For these 4 scenes, you wanted to produce content using video footage between 5-13, 14-18, 21-27 and 31-36 minutes of a 40-minute video.In this case, random durations are selected from the entered time intervals and the relevant scene productions are performed starting from these durations.The first scene starts at 7:25 minutes and continues until (+4.1)7:29.1.The second scene starts at 16:13 minutes and continues until (+2.3)16:15.3.The third scene starts at 24:12 minutes and continues until (+3.6)24:15.6.The last scene starts at 33:28 minutes and continues until (+1.9)33:29.9.etc.\nIn random mode, for each voice used as much content is generated as the value entered in How Many.\nIn random mode, time intervals are entered. 14-21,18-39,41-1:22 gibi.\nThe time intervals are specified in minutes and hours.","how-many#How Many":"When random mode is activated, the How Many option appears.Content is generated as many times as the number of values entered here. Each generated content consists of random moments of the scenes you specify."}},"/hitgun/wide/clip":{"title":"Clip","data":{"":"When activated, it generates a single video from the content generated from the duration settings in the Methods under the Factory feature.There are two different clip types, Regular and Random.","regular#Regular":"In Regular mode, content is produced in the same order as it is produced in the methods.","random#Random":"In the random clip type, content is generated in random order from the content generated by the methods.","clip-introoutro#Clip Intro/Outro":"This feature is used if you want to create intro and outro for the clips produced.\nThe file names to be used as intro and outro should be written as \" intro \" and \" outro \".\nThe file containing this content must not contain any other files.\nIf you want to use only \" Intro \", there should be a file named intro; if you want to use \" Outro \", there should be a file named outro.","custom-clip#Custom Clip":"You can use this option if you want to produce a clip from the videos on your computer.Simply place your videos in a folder and define the folder to the system.Using the Random and Regular option, you can determine the order of your content in the new content to be created."}},"/hitgun/wide/fade":{"title":"Fade","data":{"":"The Fade feature allows you to add a fading effect at the beginning and end of your videos.For example, with a fade set to 3 seconds for the beginning, the video image starts out dark and brightens at 3 seconds.If you set 3 seconds for the end of the video, the image will gradually fade to black 3 seconds before the end of the video."}},"/hitgun/wide":{"title":"Wide","data":{"":"Wide is short for widescreen.It is included in Hit Gun mode and allows you to produce horizontal content.It has additional features such as Clip and Fade.If you wish, you can create long videos by combining the content you produce into a single video with the clip feature."}},"/hitgun/wide/clip/transition":{"title":"Transition","data":{"":"When producing a clip, you may want to add transitions between the videos used.The Transition feature will fulfill this need.If checked;Transition Type - Start Over - Transitions3 options are formed as above.","transition-type#Transition Type":"There are two transition types, Regular and Random.","regular#Regular":"In a Regular transition, the transition videos you create are added to the content in a sequence.","random#Random":"In Random transition, your transitions are completely randomized and inserted between videos.","first#First":"Transitions are added between videos by default.However, in some cases, you may want to add your transition before the video.In such moments, you can check the \"First\" option to start your video with your transition content first.","transitions#Transitions":"This is the area where you will define the video of your transitions to the system."}},"/limitations":{"title":"Limitations","data":{"":"There are 4 modes in the VE3.Plus system, Single, Multi, Boost and Hit Gun, and many sub-modes under the Hit Gun mode.While the sub-modes work stably within themselves, tests are ongoing to ensure that they work in harmony with the features of other sub-modes and common features.For this reason, the use of features under testing is currently blocked.You can follow the features that are in the testing phase and the completed tests at Forum/Test."}},"/":{"title":"Introduction","data":{"":"Time is precious. It is also capital itself.\nIf we create a system that will do for us what we spend three hours a day doing,\r\nthen every three days we gain a new day to focus on other things.","ve3plus#VE3.Plus":"Your browser does not support the video tag.\nVE3.Plus is an advanced and unrivaled video editing automation that aims to save you days and months.\r\nIt allows you to complete many video editing processes with a few simple settings, allowing you to produce unlimited content.\nVideo Editing Automation is a self-processing system that applies the settings you create on an unlimited number of videos.","mods#Mods":"VE3.Plus has 4 basic mods.\nIn addition to these modes, it also includes common features used in all modes.Common features include options such as video merging, adding images, audio, logos, cropping, zooming, etc."}},"/single":{"title":"Single","data":{"":"Your browser does not support the video tag.\nIf you want to process a single video, Single mode can be preferred.Editing is performed for the first video in the folder."}},"/tutorials":{"title":"Tutorials","data":{"":"Tutorials on the use of VE3.Plus are shared in our Forum.If you wish, you can contribute to our community by sharing your own tutorials with other users through the Talent Scout category."}},"/multi":{"title":"Multi","data":{"":"Your browser does not support the video tag.\nAllows editing multiple videos in a folder.Integrates the created designs into all videos in the folder.","synchronous#Synchronous":"It was created for the Ti3 system. With the Ti3 system, it is possible to download videos from Tiktok while simultaneously\r\nthe download folder is scanned and the detected content is edited.If no new video is detected within 10 minutes, the system shuts down.","use-delete#Use-Delete":"If activated, the content that has finished editing is deleted so that the content used does not take up more space on the computer."}},"/ve3plus-helper":{"title":"VE3.Plus-Helper","data":{"":"Your browser does not support the video tag.\nVE3.Plus-Helper has been developed to make it easier for you to set your duration settings in the VE3.Plus system.Thanks to this system, you can select the desired durations very easily, especially when you need a large number of duration settings.\r\nYou can save them to your computer as a notebook with the download button or copy them directly and use them wherever you want.","features#Features":"VE3.Plus-Helper can perform duration recordings from two different sources, Youtube and Local.","youtube#Youtube":"You can use this option if you want to create duration settings for a video on YouTube.Simply enter your Youtube link in the “Enter YouTube URL” field and click the button next to it.\nYour browser does not support the video tag.","local#Local":"You can use the Local option when you want to perform operations with the videos you have on your computer.\nYour browser does not support the video tag.","modes#Modes":"When setting the duration settings, you can use Interval and Minute mode according to your needs in the VE3.Plus system.","minute-mode#Minute Mode":"Using the Factory > Method > Minutes method in the VE3.Plus system,\r\nYou can directly select the durations you want to work.The examples above are shown in Minute mode.","minuterange-mode#Minute/Range Mode":"With the Factory > Method > Minute - Range method, you can select all of the desired time intervals.\r\nMinute/Range mode helps you quickly specify the time intervals in which you want to perform work.\nYour browser does not support the video tag.","interval-mode#Interval Mode":"When you want to use the Factory > Method > Interval method, you can use the Interval Mode option.Since only minute and hour intervals are specified in Interval Mode, only minute and hour intervals are specified when Interval Mode is enabled in our VE3.Plus-Helper system.\nYour browser does not support the video tag."}}}